#Знайти всі чотирьохзначні числа, сума цифер яких дорівнює заданому числу
#Задане число. перевірити чи дане число є простим
#Задано ціле число N, вивести перші N чисел Фібоначчі
#Знайти сумі кубів цифер аданого натурального числа
#Заданий текст, вивести всі слова, які починаються на певну послідовніть символів
#З точністю до   обчислити наближене значення    для значень аргумента   та порівняти з точним значенням. Результати оформити у таблиці:

import numpy
a=0.1
b=0.8
h=0.01
k=0.02
print("-"*65)
print("|", "x".center(12), "\t|", "s".center(12), "\t|", "y".center(12), "\t|", "p".center(12), "\t|")
for x in numpy.arange(a,b,h):
    s = k*(k+1)*x**k
    y = 2*x/((1-x)**3)
    p = numpy.abs((s-y)/y)
    print("|", f"{x:9.2f}", "\t|", f"{s:9.5f}", "\t|", f"{y:9.5f}", "\t|", f"{p:9.5f}", "\t|")
    if p<10**(-5):
        print(there)
print("-"*65)