# 1. Генерується список випадкових цілих чисел. Визначається, скільки в ньому парних чисел, а скільки непарних.
# 2. Вихідний список містить позитивні і негативні числа. Потрібно позитивні помістити в один список, а негативні - в інший.
# 3. Дан список цілих чисел. Замінити негативні на -1, позитивні - на число 1, нуль залишити без змін.
# 4. Вводиться нормалізований текст, який крім слів може містити певні знаки пунктуації. Програма будує список слів, знаки пунктуації виключаються.
#    Під нормалізованим текстом будемо розуміти текст, в якому пробіл ставиться після знаків пунктуації, за винятком відкриває дужки (пробіл перед нею).
# 5. Дана матриця. Знайти в ній рядок з максимальною сумою елементів, а також стовпець.
# 6. Генерується квадратна матриця. Знайти сума елементів її головнї та побічної діагоналей.
#    Головна діагональ йде з верхнього лівого кута в правий нижній, побічна - з верхнього правого кута в лівий нижній.
# 7. Дана матриця цілих чисел. Вводиться число. З'ясувати, які рядки і стовпці матриці містять дане число.
from random import random
N = 10
M = 15
matrix = []
for i in range(N):
    row = []
    for j in range(M):
        row.append(int(random()*40)+10)
    matrix.append(row)
for row in matrix:
    print(row)
number = int(input('Input a number:' + '\n'))
row_exist = [matrix.index(row)+1 for row in matrix if number in row]
print("Number", number, "is present in rows", row_exist)
r_matrix = [[row[i] for row in matrix] for i in range(M)]
col_exist = [r_matrix.index(row)+1 for row in r_matrix if number in row]
print("Number", number, "is present in columns", col_exist)