# Генерується список випадкових цілих чисел. Визначається, скільки в ньому парних чисел, а скільки непарних.
# Вихідний список містить позитивні і негативні числа. Потрібно позитивні помістити в один список, а негативні - в інший.
# Дан список цілих чисел. Замінити негативні на -1, позитивні - на число 1, нуль залишити без змін.
# Вводиться нормалізований текст, який крім слів може містити певні знаки пунктуації. Програма будує список слів, знаки пунктуації виключаються.
# Під нормалізованим текстом будемо розуміти текст, в якому пробіл ставиться після знаків пунктуації, за винятком відкриває дужки (пробіл перед нею).
str = input("Write down or insert some text:\n")
punctuation = ['.',',',':',';','!','?','(',')']
for i in punctuation:
    str = str.replace(i, " ")
wordList = str.split()
print(wordList)
